Revit 2027 API
PanelScheduleView.AddSpace Method
 Add a space at specific cell.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSpace(
	int nRow,
	int nCol
)
Public Sub AddSpace (
	nRow As Integer,
	nCol As Integer
)
public:
void AddSpace(
	int nRow,
	int nCol
)
member AddSpace :
        nRow : int *
        nCol : int -> unit
Parameters
nRow Int32
 Row Number
nCol Int32
 Column Number
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given row number nRow is invalid in Body. -or- The given column number nCol is invalid in Body. -or- There is a circuit at given cell (nRow, nCol) already.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace